# EASY

# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"

# def your_info(name, age, city):
#     return "{}, {} лет, проживает в {}".format(name, age, city)
#
# print(your_info("Дарья", "27", "Moscow"))


# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

# def numbers(a, b, c):
#     return max(a, b, c)
#
# print(max(3, 5, 6))

# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов

# def new_function(*args):
#     return max(args, key=len)
#
# print(new_function('fff', 'gfre', 'f'))


